RT-Thread/rt-thread/bsp/fm33lc026/libraries/FM33LC0xx_FL_Driver/Inc/fm33lc0xx_fl_adc.h
/**
  *******************************************************************************************************
  * @file    fm33lc0xx_fl_adc.h
  * @author  FMSH Application Team
  * @brief   Head file of ADC FL Module
  *******************************************************************************************************
  * @attention
  *
  * Copyright (c) [2019] [Fudan Microelectronics]
  * THIS SOFTWARE is licensed under the Mulan PSL v1.
  * can use this software according to the terms and conditions of the Mulan PSL v1.
  * You may obtain a copy of Mulan PSL v1 at:
  * http://license.coscl.org.cn/MulanPSL
  * THIS SOFTWARE IS PROVIDED ON AN "AS IS" BASIS, WITHOUT WARRANTIES OF ANY KIND, EITHER EXPRESS OR
  * IMPLIED, INCLUDING BUT NOT LIMITED TO NON-INFRINGEMENT, MERCHANTABILITY OR FIT FOR A PARTICULAR
  * PURPOSE.
  * See the Mulan PSL v1 for more details.
  *
  *******************************************************************************************************
  */


/* Define to prevent recursive inclusion---------------------------------------------------------------*/
#ifndef __FM33LC0XX_FL_ADC_H
#define __FM33LC0XX_FL_ADC_H

#ifdef __cplusplus
extern "C" {
#endif
/* Includes -------------------------------------------------------------------------------------------*/
#include "fm33lc0xx_fl.h"
/** @addtogroup FM33LC0XX_FL_Driver
  * @{
  */

/** @defgroup ADC ADC
  * @brief ADC FL driver
  * @{
  */

/* Exported types -------------------------------------------------------------------------------------*/
/** @defgroup ADC_FL_ES_INIT ADC Exported Init structures
  * @{
  */

/**
  * @brief ADC Common Init Sturcture Definition
  */
typedef  struct
{
    /*ADCCLK源选择*/
    uint32_t clockSource;
    /*ADCCLK预分频配置*/
    uint32_t clockPrescaler;

} FL_ADC_CommonInitTypeDef;

/**
  * @brief ADC Init Sturcture Definition
  */
typedef struct
{
    /*连续转换模式配置*/
    uint32_t conversionMode;

    /*单次自动转换模式配置*/
    uint32_t autoMode;

    /*等待模式配置*/
    FL_FunState waitMode;

    /*覆盖模式配置*/
    FL_FunState overrunMode;

    /*通道扫描顺序配置*/
    uint32_t scanDirection;

    /*触发信号使能配置*/
    uint32_t externalTrigConv;

    /*触发源选择*/
    uint32_t triggerSource;

    /*快速通道采样时间配置*/
    uint32_t fastChannelTime;

    /*慢速通道采样时间配置*/
    uint32_t lowChannelTime;

    /*过采样使能配置*/
    FL_FunState oversamplingMode;

    /*过采样率配置*/
    uint32_t overSampingMultiplier;

    /*过采样移位配置*/
    uint32_t oversamplingShift;
} FL_ADC_InitTypeDef;

/**
  * @}
  */
/* Exported constants ---------------------------------------------------------------------------------*/
/** @defgroup ADC_FL_Exported_Constants ADC Exported Constants
  * @{
  */

#define    ADC_ISR_EOC_Pos                                        (0U)
#define    ADC_ISR_EOC_Msk                                        (0x1U << ADC_ISR_EOC_Pos)
#define    ADC_ISR_EOC                                            ADC_ISR_EOC_Msk

#define    ADC_ISR_EOS_Pos                                        (1U)
#define    ADC_ISR_EOS_Msk                                        (0x1U << ADC_ISR_EOS_Pos)
#define    ADC_ISR_EOS                                            ADC_ISR_EOS_Msk

#define    ADC_ISR_OVR_Pos                                        (2U)
#define    ADC_ISR_OVR_Msk                                        (0x1U << ADC_ISR_OVR_Pos)
#define    ADC_ISR_OVR                                            ADC_ISR_OVR_Msk

#define    ADC_ISR_BUSY_Pos                                       (3U)
#define    ADC_ISR_BUSY_Msk                                       (0x1U << ADC_ISR_BUSY_Pos)
#define    ADC_ISR_BUSY                                           ADC_ISR_BUSY_Msk

#define    ADC_ISR_AWD_UL_Pos                                     (5U)
#define    ADC_ISR_AWD_UL_Msk                                     (0x1U << ADC_ISR_AWD_UL_Pos)
#define    ADC_ISR_AWD_UL                                         ADC_ISR_AWD_UL_Msk

#define    ADC_ISR_AWD_AH_Pos                                     (6U)
#define    ADC_ISR_AWD_AH_Msk                                     (0x1U << ADC_ISR_AWD_AH_Pos)
#define    ADC_ISR_AWD_AH                                         ADC_ISR_AWD_AH_Msk

#define    ADC_IER_EOCIE_Pos                                      (0U)
#define    ADC_IER_EOCIE_Msk                                      (0x1U << ADC_IER_EOCIE_Pos)
#define    ADC_IER_EOCIE                                          ADC_IER_EOCIE_Msk

#define    ADC_IER_EOSIE_Pos                                      (1U)
#define    ADC_IER_EOSIE_Msk                                      (0x1U << ADC_IER_EOSIE_Pos)
#define    ADC_IER_EOSIE                                          ADC_IER_EOSIE_Msk

#define    ADC_IER_OVRIE_Pos                                      (2U)
#define    ADC_IER_OVRIE_Msk                                      (0x1U << ADC_IER_OVRIE_Pos)
#define    ADC_IER_OVRIE                                          ADC_IER_OVRIE_Msk

#define    ADC_IER_AWD_ULIE_Pos                                   (5U)
#define    ADC_IER_AWD_ULIE_Msk                                   (0x1U << ADC_IER_AWD_ULIE_Pos)
#define    ADC_IER_AWD_ULIE                                       ADC_IER_AWD_ULIE_Msk

#define    ADC_IER_AWD_AHIE_Pos                                   (6U)
#define    ADC_IER_AWD_AHIE_Msk                                   (0x1U << ADC_IER_AWD_AHIE_Pos)
#define    ADC_IER_AWD_AHIE                                       ADC_IER_AWD_AHIE_Msk

#define    ADC_CR_ADEN_Pos                                        (0U)
#define    ADC_CR_ADEN_Msk                                        (0x1U << ADC_CR_ADEN_Pos)
#define    ADC_CR_ADEN                                            ADC_CR_ADEN_Msk

#define    ADC_CR_START_Pos                                       (1U)
#define    ADC_CR_START_Msk                                       (0x1U << ADC_CR_START_Pos)
#define    ADC_CR_START                                           ADC_CR_START_Msk

#define    ADC_CR_EXSAMP_Pos                                      (9U)
#define    ADC_CR_EXSAMP_Msk                                      (0x1U << ADC_CR_EXSAMP_Pos)
#define    ADC_CR_EXSAMP                                          ADC_CR_EXSAMP_Msk

#define    ADC_CR_EXSYNC_Pos                                      (8U)
#define    ADC_CR_EXSYNC_Msk                                      (0x1U << ADC_CR_EXSYNC_Pos)
#define    ADC_CR_EXSYNC                                          ADC_CR_EXSYNC_Msk

