RT-Thread/rt-thread/bsp/fm33lc026/libraries/FM33LC0xx_FL_Driver/Inc/fm33lc0xx_fl_adc.h
#define    ADC_CFGR_DMAEN_Pos                                     (0U)
#define    ADC_CFGR_DMAEN_Msk                                     (0x1U << ADC_CFGR_DMAEN_Pos)
#define    ADC_CFGR_DMAEN                                         ADC_CFGR_DMAEN_Msk

#define    ADC_CFGR_DMACFG_Pos                                    (1U)
#define    ADC_CFGR_DMACFG_Msk                                    (0x1U << ADC_CFGR_DMACFG_Pos)
#define    ADC_CFGR_DMACFG                                        ADC_CFGR_DMACFG_Msk

#define    ADC_CFGR_SCANDIR_Pos                                   (2U)
#define    ADC_CFGR_SCANDIR_Msk                                   (0x1U << ADC_CFGR_SCANDIR_Pos)
#define    ADC_CFGR_SCANDIR                                       ADC_CFGR_SCANDIR_Msk

#define    ADC_CFGR_EXTS_Pos                                      (4U)
#define    ADC_CFGR_EXTS_Msk                                      (0xfU << ADC_CFGR_EXTS_Pos)
#define    ADC_CFGR_EXTS                                          ADC_CFGR_EXTS_Msk

#define    ADC_CFGR_OVRM_Pos                                      (8U)
#define    ADC_CFGR_OVRM_Msk                                      (0x1U << ADC_CFGR_OVRM_Pos)
#define    ADC_CFGR_OVRM                                          ADC_CFGR_OVRM_Msk

#define    ADC_CFGR_CONT_Pos                                      (9U)
#define    ADC_CFGR_CONT_Msk                                      (0x1U << ADC_CFGR_CONT_Pos)
#define    ADC_CFGR_CONT                                          ADC_CFGR_CONT_Msk

#define    ADC_CFGR_WAIT_Pos                                      (10U)
#define    ADC_CFGR_WAIT_Msk                                      (0x1U << ADC_CFGR_WAIT_Pos)
#define    ADC_CFGR_WAIT                                          ADC_CFGR_WAIT_Msk

#define    ADC_CFGR_SEMI_Pos                                      (11U)
#define    ADC_CFGR_SEMI_Msk                                      (0x1U << ADC_CFGR_SEMI_Pos)
#define    ADC_CFGR_SEMI                                          ADC_CFGR_SEMI_Msk

#define    ADC_CFGR_TRGCFG_Pos                                    (12U)
#define    ADC_CFGR_TRGCFG_Msk                                    (0x3U << ADC_CFGR_TRGCFG_Pos)
#define    ADC_CFGR_TRGCFG                                        ADC_CFGR_TRGCFG_Msk

#define    ADC_CFGR_IOTRFEN_Pos                                   (14U)
#define    ADC_CFGR_IOTRFEN_Msk                                   (0x1U << ADC_CFGR_IOTRFEN_Pos)
#define    ADC_CFGR_IOTRFEN                                       ADC_CFGR_IOTRFEN_Msk

#define    ADC_CFGR_OVSEN_Pos                                     (16U)
#define    ADC_CFGR_OVSEN_Msk                                     (0x1U << ADC_CFGR_OVSEN_Pos)
#define    ADC_CFGR_OVSEN                                         ADC_CFGR_OVSEN_Msk

#define    ADC_CFGR_OVSR_Pos                                      (17U)
#define    ADC_CFGR_OVSR_Msk                                      (0x7U << ADC_CFGR_OVSR_Pos)
#define    ADC_CFGR_OVSR                                          ADC_CFGR_OVSR_Msk

#define    ADC_CFGR_OVSS_Pos                                      (20U)
#define    ADC_CFGR_OVSS_Msk                                      (0xfU << ADC_CFGR_OVSS_Pos)
#define    ADC_CFGR_OVSS                                          ADC_CFGR_OVSS_Msk

#define    ADC_CFGR_AWDEN_Pos                                     (24U)
#define    ADC_CFGR_AWDEN_Msk                                     (0x1U << ADC_CFGR_AWDEN_Pos)
#define    ADC_CFGR_AWDEN                                         ADC_CFGR_AWDEN_Msk

#define    ADC_CFGR_AWDSC_Pos                                     (25U)
#define    ADC_CFGR_AWDSC_Msk                                     (0x1U << ADC_CFGR_AWDSC_Pos)
#define    ADC_CFGR_AWDSC                                         ADC_CFGR_AWDSC_Msk

#define    ADC_CFGR_AWDCH_Pos                                     (26U)
#define    ADC_CFGR_AWDCH_Msk                                     (0xfU << ADC_CFGR_AWDCH_Pos)
#define    ADC_CFGR_AWDCH                                         ADC_CFGR_AWDCH_Msk

#define    ADC_SMTR_SMTS1_Pos                                     (0U)
#define    ADC_SMTR_SMTS1_Msk                                     (0xfU << ADC_SMTR_SMTS1_Pos)
#define    ADC_SMTR_SMTS1                                         ADC_SMTR_SMTS1_Msk

#define    ADC_SMTR_SMTS2_Pos                                     (4U)
#define    ADC_SMTR_SMTS2_Msk                                     (0xfU << ADC_SMTR_SMTS2_Pos)
#define    ADC_SMTR_SMTS2                                         ADC_SMTR_SMTS2_Msk

#define    ADC_SMTR_CHCG_Pos                                      (8U)
#define    ADC_SMTR_CHCG_Msk                                      (0xfU << ADC_SMTR_CHCG_Pos)
#define    ADC_SMTR_CHCG                                          ADC_SMTR_CHCG_Msk

#define    ADC_SAMPT_SAMPT_S_Pos                                  (0U)
#define    ADC_SAMPT_SAMPT_S_Msk                                  (0x1U << ADC_SAMPT_SAMPT_S_Pos)
#define    ADC_SAMPT_SAMPT_S                                      ADC_SAMPT_SAMPT_S_Msk

#define    ADC_HLTR_AWD_LT_Pos                                    (0U)
#define    ADC_HLTR_AWD_LT_Msk                                    (0xfffU << ADC_HLTR_AWD_LT_Pos)
#define    ADC_HLTR_AWD_LT                                        ADC_HLTR_AWD_LT_Msk

#define    ADC_HLTR_AWD_HT_Pos                                    (16U)
#define    ADC_HLTR_AWD_HT_Msk                                    (0xfffU << ADC_HLTR_AWD_HT_Pos)
#define    ADC_HLTR_AWD_HT                                        ADC_HLTR_AWD_HT_Msk



#define    FL_ADC_EXTERNAL_CH0                                    (0x1U << 0U)
#define    FL_ADC_EXTERNAL_CH1                                    (0x1U << 1U)
#define    FL_ADC_EXTERNAL_CH2                                    (0x1U << 2U)
#define    FL_ADC_EXTERNAL_CH3                                    (0x1U << 3U)
#define    FL_ADC_EXTERNAL_CH4                                    (0x1U << 4U)
#define    FL_ADC_EXTERNAL_CH5                                    (0x1U << 5U)
#define    FL_ADC_EXTERNAL_CH6                                    (0x1U << 6U)
#define    FL_ADC_EXTERNAL_CH7                                    (0x1U << 7U)
#define    FL_ADC_EXTERNAL_CH8                                    (0x1U << 8U)
#define    FL_ADC_EXTERNAL_CH9                                    (0x1U << 9U)
#define    FL_ADC_EXTERNAL_CH10                                   (0x1U << 10U)
#define    FL_ADC_EXTERNAL_CH11                                   (0x1U << 11U)
#define    FL_ADC_INTERNAL_TS                                     (0x1U << 16U)
#define    FL_ADC_INTERNAL_VREF1P2                                (0x1U << 17U)
#define    FL_ADC_INTERNAL_OPA1                                   (0x1U << 18U)
#define    FL_ADC_INTERNAL_OPA2                                   (0x1U << 19U)



